<?php
/*Действия с числами*/
$a = 7;
$b = 3;
$c = 7.15;
$d = 25;
$ab = $a % $b;
$ac = $a + $c;
echo 'остаток деления ' . $a . ' на ' . $b . ' - (' . $ab . ')';
echo '</br>' . 'целая часть сложения ' . $a . ' на ' . $c . ' - (' . floor ($ac) . ')';
echo '</br>' . 'корень из ' . $d . ' - (' . sqrt ($d) . ')';
echo '</br>';

/*Действия со строками*/
$alf = 'АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя';
$fr = 'Десять негритят пошли купаться в море';
$num1 = 4;
$i = $num1 - 1;
$words = str_word_count($fr, 1, $alf);
echo '</br>' . $num1 . '-e' . ' слово в строке - ' . $words[$i];
$num2 = 17;
$i = $num2 - 1;
echo '</br>' . $num2 . '-й символ из фразы - ' . mb_substr($fr, $i, 1, 'UTF-8');
echo '</br>' . mb_convert_case($fr, MB_CASE_TITLE, "UTF-8");
echo '</br>' . 'длина строки ' . ' - (' . mb_strlen($fr) . ')';
echo '</br>';


/*Действия с логическими значениями*/
echo '</br>';
var_dump((bool) 1);  /* правильно, возвращает true */
var_dump(false === 0); /* жесткое сравнение логического и числового типа данных, возвращает false */


$str1 = 'three';
$str2 = 'три';
if (mb_strlen($str1) > mb_strlen($str2)) {
    echo $str1 . ' длинне чем ' . $str2;
}
else {
    echo '</br>' . $str2 . ' длинне чем ' . $str1;
}

$sum1 = 125 * 13 + 7;
$sum2 = 223 + 28 * 2;
echo '</br>' . $sum1 . '</br>' . $sum2;
if ($sum1 > $sum2) {
    echo '</br>' . '125*13+7' . ' больше чем ' . '223+28*2';
}
else {
    echo '</br>' . '223+28*2' . ' больше чем ' . '125*13+7';
}

